[
  { "q": "I speak without a mouth and hear without ears. I have no body, but I come alive with wind. What am I?", "a": "An echo" },
  { "q": "The more you take, the more you leave behind. What am I?", "a": "Footsteps" },
  { "q": "I have cities, but no houses live there. I have mountains, but no trees grow there. I have water, but no fish swim there. What am I?", "a": "A map" },
  { "q": "What has hands but can't clap?", "a": "A clock" },
  { "q": "I'm light as a feather, yet the strongest person can't hold me for five minutes. What am I?", "a": "Breath" },
  { "q": "What gets wetter as it dries?", "a": "A towel" },
  { "q": "I have a head and a tail but no body. What am I?", "a": "A coin" },
  { "q": "What has one eye but can't see?", "a": "A needle" },
  { "q": "The more you have of it, the less you see. What is it?", "a": "Darkness" },
  { "q": "What runs but never walks, has a mouth but never talks, has a head but never weeps, has a bed but never sleeps?", "a": "A river" },
  { "q": "I have branches, but no fruit, trunk, or leaves. What am I?", "a": "A bank" },
  { "q": "What can travel around the world while staying in a corner?", "a": "A stamp" },
  { "q": "What has a thumb and four fingers but is not alive?", "a": "A glove" },
  { "q": "What has many teeth but cannot bite?", "a": "A comb" },
  { "q": "What is always in front of you but can't be seen?", "a": "The future" },
  { "q": "What can you catch but not throw?", "a": "A cold" },
  { "q": "What goes up but never comes down?", "a": "Your age" },
  { "q": "The more you take away from me, the bigger I become. What am I?", "a": "A hole" },
  { "q": "What has legs but cannot walk?", "a": "A table" },
  { "q": "I have keys but no locks. I have space but no room. You can enter but can't go inside. What am I?", "a": "A keyboard" },
  { "q": "I am always hungry and must always be fed. The finger I touch will soon turn red. What am I?", "a": "Fire" },
  { "q": "What has words but never speaks?", "a": "A book" },
  { "q": "What can fill a room but takes up no space?", "a": "Light" },
  { "q": "I have a neck but no head, and I wear a cap. What am I?", "a": "A bottle" },
  { "q": "The person who makes it has no need for it. The person who buys it has no use for it. The person who uses it can neither see nor feel it. What is it?", "a": "A coffin" },
  { "q": "What is cut on the table but never eaten?", "a": "A deck of cards" },
  { "q": "I'm not alive, but I can grow. I don't have lungs, but I need air. I don't have a mouth, but water kills me. What am I?", "a": "Fire" },
  { "q": "What has a bottom at the top?", "a": "Your legs" },
  { "q": "What flies without wings?", "a": "Time" },
  { "q": "What question can you never answer yes to?", "a": "Are you asleep?" },
  { "q": "I have no voice, yet I speak to you. I tell of all things in the world. I have leaves but I'm not a tree. What am I?", "a": "A book" },
  { "q": "What can you hold in your left hand but not in your right?", "a": "Your right elbow" },
  { "q": "I am an odd number. Take away a letter and I become even. What number am I?", "a": "Seven (remove the 's')" },
  { "q": "What tastes better than it smells?", "a": "A tongue" },
  { "q": "What goes up and down but doesn't move?", "a": "A staircase" },
  { "q": "I'm white when dirty and black when clean. What am I?", "a": "A chalkboard" },
  { "q": "What has four wheels and flies?", "a": "A garbage truck" },
  { "q": "If you have me, you want to share me. If you share me, you no longer have me. What am I?", "a": "A secret" },
  { "q": "I shrink smaller every time I take a bath. What am I?", "a": "Soap" },
  { "q": "What has 88 keys but can't open a single door?", "a": "A piano" },
  { "q": "What is so fragile that saying its name breaks it?", "a": "Silence" },
  { "q": "What do you bury when it's alive and dig up when it's dead?", "a": "A plant" },
  { "q": "What starts with T, ends with T, and has T in it?", "a": "A teapot" },
  { "q": "I have no eyes, no nose, no ears, but I can sense the weather. What am I?", "a": "A barometer" },
  { "q": "What is the only thing you can break by saying it?", "a": "Silence" },
  { "q": "People make me, save me, change me, raise me. What am I?", "a": "Money" },
  { "q": "What comes once in a minute, twice in a moment, but never in a thousand years?", "a": "The letter M" },
  { "q": "I'm the beginning of eternity, the end of time and space. I'm the beginning of every end and the end of every race. What am I?", "a": "The letter E" },
  { "q": "I have three lives: gentle enough to soothe the skin, light enough to caress the sky, hard enough to crack rocks. What am I?", "a": "Water" },
  { "q": "What has a ring but no finger?", "a": "A telephone" },
  { "q": "What room can no one enter?", "a": "A mushroom" },
  { "q": "Take away my first letter, and I still sound the same. Take away my last letter, I still sound the same. Even take away my letter in the middle, I will still sound the same. I am a five-letter word. What am I?", "a": "Empty" },
  { "q": "What can run but never walks, has a mouth but never talks?", "a": "A river" },
  { "q": "What belongs to you but is used more by others?", "a": "Your name" },
  { "q": "The eight of us go forth not back to protect our king from an attacker's track. What are we?", "a": "Chess pawns" },
  { "q": "What do you throw out when you want to use it, but take in when you don't?", "a": "An anchor" },
  { "q": "I'm full of holes but strong as steel. What am I?", "a": "A chain" },
  { "q": "What connects two people but touches only one?", "a": "A wedding ring" },
  { "q": "Forward I am heavy, but backwards I am not. What am I?", "a": "Ton (not backwards)" },
  { "q": "What is harder to catch the faster you run?", "a": "Your breath" },
  { "q": "I can be long, or I can be short. I can be grown, and I can be bought. I can be painted or left bare. I can be round or square. What am I?", "a": "Fingernails" },
  { "q": "What has one head, one foot and four legs?", "a": "A bed" },
  { "q": "What do you see once in June, twice in November, and not at all in May?", "a": "The letter N" },
  { "q": "If you drop me, I'm sure to crack. Give me a smile and I'll always smile back. What am I?", "a": "A mirror" },
  { "q": "I'm always on the dinner table, but you don't eat me. What am I?", "a": "Plates and cutlery" },
  { "q": "What has many needles but doesn't sew?", "a": "A Christmas tree" },
  { "q": "What do you call a fish without eyes?", "a": "A fsh" },
  { "q": "What do Alexander the Great and Winnie the Pooh have in common?", "a": "The same middle name (the)" },
  { "q": "What can't talk but will reply when spoken to?", "a": "An echo" },
  { "q": "A woman shoots her husband, then holds him underwater for over five minutes. A little while later, they go out to dinner together. How?", "a": "She took his photo and developed it in a darkroom" },
  { "q": "What can be swallowed, but can also swallow you?", "a": "Pride" },
  { "q": "I'm not a bird, but I can fly through the sky. I'm not a river, but I'm full of water. What am I?", "a": "A cloud" },
  { "q": "What loses its head in the morning but gets it back at night?", "a": "A pillow" },
  { "q": "I have cities with no houses, forests with no trees, and water with no fish. What am I?", "a": "A map" },
  { "q": "Why did the scarecrow win an award?", "a": "Because he was outstanding in his field" },
  { "q": "I start with M, end with X, and have never-ending amount of letters. What am I?", "a": "A mailbox" },
  { "q": "I'm found in socks, scarves and mittens; and often in the paws of playful kittens. What am I?", "a": "Yarn" },
  { "q": "What rock group has four members, all of whom are dead, one of whom was shot?", "a": "Mount Rushmore" }
]
