[
  "Their WiFi password is 'password123' — and they're proud of it.",
  "They use Internet Explorer... unironically.",
  "Their GitHub is just a long list of 'initial commit' entries.",
  "The only thing they've ever committed to is a 60-day free trial that auto-renewed.",
  "They once opened a terminal and immediately googled 'how to close a terminal'.",
  "Their README just says 'TODO: write readme'.",
  "They reply to DMs with 'k' and think that's a full conversation.",
  "They muted the server notifications but still complain about missing announcements.",
  "Their code is so spaghetti that even Italian grandmothers are confused.",
  "They joined 47 servers and haven't talked in any of them.",
  "They print 'Hello World' in production and call it a feature.",
  "Their pull requests have more conflicts than a soap opera.",
  "They use Comic Sans in their presentation slides. Ironically. Or so they say.",
  "Their error handling strategy is commenting out the error.",
  "They have 200 browser tabs open and no idea what half of them are.",
  "They type 'google.com' into Google to get to Google.",
  "Their merge strategy is 'works on my machine, ship it.'",
  "They asked an AI to write their entire résumé and misspelled 'AI'.",
  "Their backup strategy is hoping really hard nothing breaks.",
  "They use spaces instead of tabs, but argue about it like it's a personality trait.",
  "They've been 'almost done' for three weeks.",
  "Their idea of documentation is a sticky note that fell off two months ago.",
  "They update dependencies once a year, in production, on a Friday.",
  "Their dev environment has more environment variables than actual features.",
  "They spelled 'algorithm' wrong in the comment explaining their algorithm.",
  "Their hotfix created two new bugs and a philosophical crisis.",
  "They pushed to main on a Friday and turned off Slack notifications.",
  "Their function names are 'doStuff', 'doMoreStuff', and 'finallyDoIt'.",
  "They commented out failing tests to make CI pass.",
  "They wrote 'TODO: fix this' in 2019 and it's still there.",
  "Their standup is longer than their sprint.",
  "They forgot semicolons and then spent 4 hours wondering why it broke.",
  "They use global variables and sleep fine at night.",
  "Their 'small refactor' touched 47 files.",
  "They googled the same StackOverflow answer for the 15th time this week.",
  "Their naming convention is 'whatever felt right in the moment.'",
  "They have a CSS file with !important on every single line.",
  "Their database query fetches all columns because 'we might need them someday'.",
  "They deployed without testing because 'it worked in dev'.",
  "Their variable names are x, xx, and xxx and they see nothing wrong with that.",
  "They rewrite the same utility function from scratch every project.",
  "Their unit tests test that 1 + 1 === 2, and nothing else.",
  "They asked ChatGPT to debug code they didn't understand in the first place.",
  "Their branch name is 'final_FINAL_v2_actualfinal'.",
  "They copy-paste from StackOverflow but don't read what it does.",
  "Their commit history is a single commit: 'stuff'.",
  "They configured CORS to allow everything and called it 'flexible architecture'.",
  "They once broke prod by changing a comment.",
  "Their API returns 200 for every error response.",
  "They store passwords in plain text and encrypt their grocery list."
]
